siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SLEEP_DRV8912_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SLEEP_DRV8912_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SLEEP_DRV8912_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SLEEP_DRV8912_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SLEEP_DRV8912_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SLEEP_DRV8912_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SLEEP_DRV8912_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_7 (number 21), FAULT_DRV8912
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FAULT_DRV8912_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_FAULT_DRV8912_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_FAULT_DRV8912_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_FAULT_DRV8912_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FAULT_DRV8912_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FAULT_DRV8912_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_0 (number 22), SPI_SDO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_SDO_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SDO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SDO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT4_1 (number 23), SPI_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_SCK_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SCK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SCK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT4_2 (number 24), SPI_SDI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_SDI_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SDI_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SDI_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT4_3 (number 25), PCS_TDC1000_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCS_TDC1000_1_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCS_TDC1000_1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCS_TDC1000_1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_4 (number 26), PCS_TDC1000_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCS_TDC1000_2_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCS_TDC1000_2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCS_TDC1000_2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_5 (number 27), PCS_DRV89XX_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCS_DRV89XX_2_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCS_DRV89XX_2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCS_DRV89XX_2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_6 (number 28), PCS_DRV89XX_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCS_DRV89XX_1_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCS_DRV89XX_1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCS_DRV89XX_1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_13 (number 36), TC78H660_MODE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TC78H660_MODE_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TC78H660_MODE_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TC78H660_MODE_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TC78H660_MODE_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TC78H660_MODE_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TC78H660_MODE_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TC78H660_MODE_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT4_15 (number 37), TC78H660_STBY
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TC78H660_STBY_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TC78H660_STBY_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TC78H660_STBY_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TC78H660_STBY_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TC78H660_STBY_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TC78H660_STBY_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TC78H660_STBY_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT4_16 (number 38), MOTOR1_ONOFF_CTRL
  @{ */

