siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR1_ONOFF_CTRL_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_17 (number 39), MOTOR1_DIR_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR1_DIR_CTRL_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT5_0 (number 48), MOTOR2_ONOFF_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR2_ONOFF_CTRL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_1 (number 49), MOTOR2_DIR_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MOTOR2_DIR_CTRL_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT1_14 (number 7), TDCOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDCOUT_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDCOUT_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDCOUT_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_15 (number 8), TDC_CHSEL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC_CHSEL_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC_CHSEL_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TDC_CHSEL_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC_CHSEL_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC_CHSEL_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC_CHSEL_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC_CHSEL_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_30 (number 10), TDC_RESET
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC_RESET_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC_RESET_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TDC_RESET_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC_RESET_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC_RESET_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC_RESET_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC_RESET_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_31 (number 11), TDC_TRIGGER
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC_TRIGGER_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC_TRIGGER_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TDC_TRIGGER_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC_TRIGGER_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC_TRIGGER_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC_TRIGGER_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC_TRIGGER_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_0 (number 14), TDC1_EN
  @{ */

