siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC1_EN_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC1_EN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TDC1_EN_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC1_EN_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC1_EN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC1_EN_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC1_EN_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_1 (number 15), TDC2_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC2_EN_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC2_EN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TDC2_EN_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC2_EN_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC2_EN_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC2_EN_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC2_EN_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_2 (number 16), CAMERA_MCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_MCLK_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_MCLK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_MCLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_5 (number 19), TDC_ERR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TDC_ERR_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TDC_ERR_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TDC_ERR_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC_ERR_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC_ERR_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC_ERR_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT4_12 (number 35), TDC_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TDC_CLK_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TDC_CLK_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TDC_CLK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_11 (number 67), PSRAM_D3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_D3_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_D3_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_D3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_10 (number 68), PSRAM_D2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_D2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_D2_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_D2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_9 (number 69), PSRAM_D1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_D1_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_D1_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_D1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_8 (number 70), PSRAM_D0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_D0_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_D0_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_D0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_7 (number 71), PSRAM_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_SCK_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_SCK_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_SCK_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_0 (number 75), PSRAM_CS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PSRAM_CS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PSRAM_CS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PSRAM_CS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT0_4 (number 80), CAMERA_VSYNC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_VSYNC_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_VSYNC_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_VSYNC_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_19 (number 87), TCA9803_EN
  @{ */

