siva100403/CHEWIE_ASBV21/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TCA9803_EN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TCA9803_EN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_TCA9803_EN_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_TCA9803_EN_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TCA9803_EN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TCA9803_EN_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TCA9803_EN_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_1 (number 93), CAMERA_PWDN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMERA_PWDN_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMERA_PWDN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CAMERA_PWDN_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CAMERA_PWDN_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_PWDN_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_PWDN_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_PWDN_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_2 (number 94), CAMERA_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMERA_RST_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMERA_RST_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CAMERA_RST_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CAMERA_RST_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_RST_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_RST_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_RST_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_3 (number 95), CAMERA_LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_LED_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_LED_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_LED_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_4 (number 97), CAMERA_D0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D0_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D0_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D0_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_5 (number 98), CAMERA_D1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_6 (number 99), CAMERA_D2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_7 (number 100), CAMERA_D3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D3_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_8 (number 1), CAMERA_D4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D4_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D4_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D4_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_9 (number 2), CAMERA_D5
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D5_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D5_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D5_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_10 (number 3), CAMERA_D6
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D6_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D6_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D6_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_11 (number 4), CAMERA_D7
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMERA_D7_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMERA_D7_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMERA_D7_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
